[{"company_name": "Cloudera", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Palo Alto, CA", "size_text": "1k Employees", "industry_text": "Internet & Software industry", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "-Software Engineering - Full-Time & Intern\n-Customer Operations Engineer - Full-Time\n-Associate Consultant - Full-Time", "about_text": "Cloudera is the leading provider of Apache Hadoop-based software and services and works with customers in financial services, web, telecommunications, government and other industries.\n\nCloudera offers enterprises a powerful new data platform built on the popular Apache Hadoop open-source software package. We enhance the storage and processing technologies originally developed by the world’s biggest Web companies, allowing our growing list of global customers to use Hadoop to solve problems and achieve their particular business goals.\n\nEveryone knows that data volumes are growing exponentially. What’s not so clear is how to unlock the value it holds. The answer is Cloudera, the Platform for Big Data. With a single, integrated enterprise-class solution, Cloudera lets you efficiently query all of your data - structured and unstructured - and have a view beyond data sitting in relational databases. Equally important, Cloudera's platform runs in real time, so you can work at the speed of thought as you build rapidly on deep insights, create competitive advantage and become truly data-driven.", "culture_text": "A new era in enterprise data management is upon us. Cloudera’s products and services, built on the open source Apache Hadoop platform, are fundamentally changing the economics of data warehousing, processing, analysis and business intelligence. Join Cloudera and help people around the world find answers to the world's biggest questions.\n\nFrom the start, we have known that we needed to recruit and retain highly talented people in order to create the next generation platform for enterprise data management. We’re looking for smart people with innovative ideas who want to do remarkable things."}, {"company_name": "Johnson & Johnson", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "New Brunswick, NJ", "size_text": "10,000+ Employees", "industry_text": "", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "The Johnson & Johnson Family of Companies is organized into three business segments— Consumer, Pharmaceuticals, and Medical Devices. We are the world’s most broadly based global health care business serving customers, patients and medical professionals through more than 275 companies in over 60 countries.\nEmployees within our companies are empowered to leverage this global network to deliver solutions that better serve the needs of those who use our products and services. They have access to world-class programs for personal and professional development, and the potential to drive a dynamic career across businesses, segments and functional roles.", "culture_text": "We each bring a unique set of experiences from dozens of cultural backgrounds.Our shared values unify our direction and decisions, helping us touch the lives of more than a billion people every day.\nWe collaborate in teams and continuously share and refine critical skills and methods. We value the unique perspective and approach that each person brings. We foster an environment that celebrates and leverages diversity. We welcome everyone to be authentic about who they are and the perspective they offer. We ensure that every member of the team has a chance to make their mark and drive their career growth."}, {"company_name": "OSIsoft", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "San Leandro, CA", "size_text": "1001-5000 Employees", "industry_text": "Computer Software", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "OSIsoft, a global leader in operational intelligence, delivers an open enterprise infrastructure to connect sensor-based data, operations and people to enable real-time and actionable insights. As the maker of the PI System, OSIsoft empowers companies across a range of industries in activities such as exploration, extraction, production, generation, process and discrete manufacturing, distribution and services to leverage streaming data to optimize and enrich their businesses. For over thirty years, OSIsoft customers have embraced the PI System to deliver process, quality, energy, regulatory compliance, safety, security and asset health improvements across their operations. ", "culture_text": "We pride our self as being an open collaborative work place. We value our employees, and respect their life outside of work. We strive to maintain a flat organization with a serious open door policy. If you ever wanted to talk with any of executives, the opportunity is always there (seriously, we have had interns sit down with our CEO and president just to talk). \n\nIf you like working with other smart engineers, problem solving, and helping customers, then OSIsoft might be the right place for you. Oh, the other great thing, if you ever see a problem or need within your organization, or outside, you can always talk with your manager, and go about solving that problem or addressing that need. It is how many of our products and departments have started. "}, {"company_name": "Lam Research", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Fremont, CA", "size_text": "9,400 Employees", "industry_text": "", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "Together we move the Atoms that move the World\n\n“… We're on the cusp of one of the most exciting periods in the technology industry, and the semiconductor road-map, the silicon device, and the industry of capital equipment. Lam Research, specifically, is right at the center of making that possible.” -Martin Anstice, CEO Lam Research\n\nImagine working on the front lines of innovation! As one of the semiconductor industry’s leading suppliers of wafer fabrication equipment and services, our technology depends on finding and hiring the best and the brightest employees. We know that our dynamic, global team of exceptional employees is essential to our continued growth.", "culture_text": "Let's infuse technology with humanity.\n\nWe do things differently at Lam. From benefits to rewards, communication to community, together we’re building the company where we all want to work. We listen to each other, celebrate our differences, evolve, collaborate, and make sure the best ideas win. We’re working together on what moves us all forward.\n\nCommitted to diversity, inclusion and you.\n\nWe’re better together. Every one of us has unique viewpoints and experiences, which are the key to unlocking new innovations. Diversity promotes creativity, mutual respect, growth—all of which are central to our Core Values. But diversity and inclusion must be continually fostered and nurtured. That’s why we promote it in the STEM pipeline from elementary schools to universities and professional organizations. It’s why we’ve established a former military hiring program to help hire and place veterans. And it’s why we support university sponsorship and professional networking events for our employees.\n\nTo us, success means reflecting the communities where we work and the customers we serve. That’s the kind of success we’re constantly striving for."}, {"company_name": "Baidu USA", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Sunnyvale, CA", "size_text": "200 Employees", "industry_text": "Technology", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "Baidu, Inc. (Chinese: 百度; pinyin: Bǎidù, anglicized /ˈbaɪduː/ BY-doo), incorporated on 18 January 2000, is a Chinese multinational technology company specializing in Internet-related services and products, and artificial intelligence, headquartered at the Baidu Campus in Beijing's Haidian District. It is one of the largest AI and internet companies in the world. Baidu was established in 2000 by Robin Li. \n\nBaidu USA is home to Baidu Intelligent Driving Group US, Baidu Research US, Baidu USDC and Duer US. Baidu USDC develops Internet-related business opportunities and advanced technologies in areas such as advertising, security, big data and cloud computing. Duer US is focused on developing leading edge conversational OS for everyone and everywhere.\nBaidu Research brings together global research talent to work on fundamental technologies in areas such as image recognition and image-based search, voice recognition, natural language processing and semantic intelligence. Baidu Research comprises of three labs: the Silicon Valley AI Lab, the Institute of Deep Learning, and the Big Data Lab. The latter are based in Beijing, China.", "culture_text": "“Simple and reliable” isn’t just about Baidu’s core values, it also defines the way we believe we should interact with others, and forms the guiding principle for all our work.\n\n“Simple” literally means pure and uncomplicated. For Baidu, it is not only a value, but also an approach to doing things, requiring us to deal with people and things in an uncomplicated way, and to provide the simplest, easiest-to-use products.\n\nA \"reliable” person or thing is one that can be trusted and counted on. “Reliable” does not equal “trustworthy.” In the sense that we use it, “reliable” has something akin to familial love in it. “Reliability”, as advocated by Baidu, requires everyone to be professionally strong, to fully trust colleagues, and to devote familial love to and help one another."}, {"company_name": "Viasat", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Carlsbad, CA", "size_text": "1001-5000 Employees", "industry_text": "Telecommunications", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "We’re Viasat\nViasat is a global communications company ensuring people can stay connected whether they’re on the ground, in the air or at sea. We’re doing what others in the communications industry view as impossible like enabling families living in the most remote parts of the world to stream movies in 4K, bringing internet access to rural villages for the first time, or allowing those that live in city centers to have more choice for how they enjoy the internet; we’re enabling passengers and operations crews to stream high-bandwidth multimedia when flying at 35,000 feet or when sailing in the middle of the Ocean; and we’re empowering our warfighters on the front lines of battle with real-time, secure communications for critically-important intelligence, surveillance, and reconnaissance missions. We deliver and protect information – when and where it is needed most – with our trusted communications network.\n \nBringing high-quality communications and connectivity to the world is no small feat. We’re one team, 4,500 strong and growing, brought together by a shared curiosity and a shared interest to find a better way to bring the world the connections that matter. We’re breaking preconceived notions, using fearless innovation and redefining what’s possible by building the ultimate communications network. This network centers on our ultra-high capacity communications satellites and uses our advanced encryption and cyber technologies coupled with both our ground- and virtualized-based infrastructures to seamlessly tie into our international network of managed Wi-Fi hotspots to deliver a best available network that extends the reach and accessibility needed of broadband internet service, globally. \n \n\nWe think big, we act intelligently, and we’re not done…we’re just beginning\n\n\nWhat Inspires Us\nContinuously growing demand for broadband is indisputable; with total global bandwidth consumption doubling every two to three years. In 2010, 1.8 billion people were connected. That number would increase to 3 billion in 2017. And by 2025, the hope would be for the remaining 8+ billion people on the planet to all be connected – leaving the notion of the digital divide behind.\n \nWe are inspired to connect the world daily, and have set out to advance global connectivity beyond what traditional telecom, wireless, cable or fiber could deliver. This mission would lead us on a journey to use bold, innovative thinking in pursuit of solving one of the hardest communications problems: making the internet accessible and affordable to all.\n \nWe have a long history, 30+ years, of making bold commitments, then delivering on them – to our customers, our shareholders, and ourselves. We are bringing the same high-quality connections to individuals and families as we do to critical business, government, and military around the world.\n \nIn 2017, we unveiled Viasat-2 – a satellite system so unique it would be the catalyst for connecting continents, people, and places. It is the precursor to delivering ultimate internet experiences anywhere on the planet, where continuous, high-speed global connectivity is not a theory but a fact. \n \n\nBy 2019, we will begin to launch the world’s first a global broadband network. This network will be based on Viasat-3, a next-generation, ultra-high capacity satellite constellation that will deliver the only affordable, high-speed, high-quality continuous internet and streaming service. Once fully deployed, the Viasat-3 network will have three times the total combined network capacity of the approximate 400 commercial communications satellites in space today, and will deliver fiber-like speeds to consumers, businesses, and military, anywhere.", "culture_text": "Culture is not what you or I say it is – culture is what we actually do without even thinking much about it. Certainly I and others can influence it over time – but it’s what we all do collectively that matters. It is really a set of shared values and assumptions.\nOur company culture is inextricably interwoven with strategy. It empowers us to do things that other companies would find daunting, if not impossible. \n "}, {"company_name": "Yext", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "New York, New York", "size_text": "800 Employees", "industry_text": "Software", "visa_sponsorship_text": "yes", "hiring_text": "Full-time and Summer interns", "positions_text": "Software Engineering (NYC and VA);\nProduct Management (NYC only); \nProject Management (VA only); \nVisual Web Design (VA only)", "about_text": "Yext puts business on the map. The Yext Knowledge Engine™ lets companies manage their digital knowledge in the cloud and sync it to over 100 services in the PowerListings® Network. Yext Listings, Pages, and Reviews help businesses around the globe facilitate face-to-face and digital interactions that boost brand awareness, drive foot traffic, and increase sales.The Yext engineering team drives the technology behind our revolutionary product offering!  We’re looking for Software Engineers, Product Managers, Project Managers and Visual Web Designers to help us continue building out our product and services.  Our team works in an agile environment running two-week sprints that culminate with demos of features in progress.  You will work alongside engineers from the top universities and tech companies in the world, hands-on with the code from day one. \n\nYext has amazing perks and benefits including: free lunch and dinner, flexible vacation, free benefits, tons of social activities, and off-site trips with the Engineering team!  Popular activities around the office include: ping pong, Smash tournaments, celebrating every food day, poker nights, book clubs, etc etc.", "culture_text": "What We're Doing\n\nBuilding useful, evolving software: We ship code everyday using multiple programming languages\nHelping businesses get found: Making sure businesses are everywhere their customers are looking\nImproving data on local services: Local geodata & content helps people get where they want to go\n\n\nEngineering at Yext\n\nHigh Impact: You'll push code day 1 and work across our entire code base. You'll impact the future of the company, and take on more as we grow.\nDevelopment: We support learning and experimenting. Whether it's reading groups or your own project, Yext wants you to keep learning.\nGrowing Company: It's an exciting time to be at Yext. Here you can have a big impact on a product and company with a bright future.\n\n\nWe also like to have fun at work!  Our fun rooms are filled with gaming systems, foosball & ping pong tables, board games, musical instruments, & a kegerator."}, {"company_name": "Aptiv", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Dublin", "size_text": "10,000+ Employees", "industry_text": "Electrical/Electronics Manufacturing", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "Electrical Engineer,\nSoftware Engineer,\nCybersecurity Engineer,\nMechanical Engineer,\nFinance and Accounting Analyst,\nSupply Chain Analyst,\nCorporate Communications / Marketing Assistant,\nHuman Resources Associate,\nLegal Assistant,\nSales Associate", "about_text": "Aptiv is an advanced technology company with a proven history of enabling mobility. We’re dedicated to bringing the next generation of autonomous vehicles, smart cities and connectivity to life.\n \nWe have the innovation and decisiveness of a start up, and a history of shaping the future of mobility. And with access to a global network of engineers who are ready to collaborate and problem-solve anytime, anywhere – you’ll find yourself in good company.\n\nAptiv offers the unique opportunity to transform the future of mobility and to be a global leader in an industry that’s changing the world. To us, nothing is impossible when you have the people with the passion to make anything possible.", "culture_text": "Dreamers Who Do\nAptiv offers the unique opportunity to transform the future of mobility and to be a global leader in an industry that’s changing the world. To us, nothing is impossible when you have the people with the passion to make anything possible.\n \n \nWe have the innovation and decisiveness of a start up and a history of shaping the future of mobility. And with access to a global network of engineers who are ready to collaborate and problem-solve anytime, anywhere – you’ll find yourself in good company."}, {"company_name": "Medallia", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Palo Alto, CA", "size_text": "1000+ Employees", "industry_text": "Enterprise Software, SaaS, Cloud Computing, B2B", "visa_sponsorship_text": "j-1, h-1b, tn", "hiring_text": "Currently hiring winter/spring graduates, interns, and co-ops", "positions_text": "Software Engineers, Professional Services Analysts, IT/Systems Admin", "about_text": "Lead a Movement\nWe built the category of Customer Experience Management and continue to lead it across the globe. \nThink about the last interaction you had with a company. Was it good? Could it have been better? Most organizations don't know, and that's what we're looking to change. We give companies access to their clients' ears, eyes, and hearts, so they can wire the customer voice into every decision. Build a Community\nWe're building a community of transformation, and each one of us is responsible for its growth. We challenge, teach, develop, and support each other – in and out of work – and over happy hours, hackathons, ski trips, hip-hop flash mobs, and fireside chats. Never Settle   \nWe're a culture based on growth mindset. We set the bar high, and then we set it higher - for our clients, our product, and ourselves.", "culture_text": "Our mission is to create a world where companies are loved by their customers; where organizations see you as a person and not just their next sale. We do this by building a bridge between hundreds of companies and billions of customers, around the world, enabling access to your eyes, ears, and hearts, so they may design and deliver extraordinary experiences, every single day. Why? Because we truly believe that no one should ever feel like they’re at the DMV...except when they’re at the DMV."}, {"company_name": "VMware", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Palo Alto, California", "size_text": "19,000 Employees", "industry_text": "Information Technology", "visa_sponsorship_text": "", "hiring_text": "//careers.vmware.com/", "positions_text": "Intern and Full Time Opportunities", "about_text": "VMware, the industry-leading virtualization software company, empowers organizations to innovate and thrive by streamlining IT operations. By virtualizing infrastructure—from the data center to the cloud to mobile devices—VMware enables IT to deliver services from any device, anytime, anywhere.  At VMware, interns and new graduates are both challenged and rewarded with meaningful work and rich experiences in an environment made of hard work, tenacity, accountability, transparency, inclusiveness, and a culture of learning and service to each other, our customers and the community. Learn how you can bring your innovative ideas here and watch them grow.", "culture_text": "How we deliver on our vision comes through in our everyday actions. Our people are driven to create amazing innovations in a workplace that encourages and supports growth, learning and collaboration. Our core values guide what we do and how we do it:\n\nExecution:  \n\nDo It Together. \n\nWe debate, discuss, and then get things done as One VMware. We check our egos at the door and work together without compromising impact, quality or efficiency.\n\nPassion:  \n\nChallenge the Status Quo. \n\nWe are fueled by curiosity and the pursuit of the seemingly impossible to continuously make things better for our customers, products and each other.\nIntegrity:  \n\nBuild Trust. \n\nWe say what we do then do what we say. We build and nurture relationships with one another, our customers, partners, shareholders, and community without taking anything for granted.\n\nCustomers:  \n\nMake It Possible. \n\nOur customers are core to our mission. We empower our customers by freeing them from constraints so they can meet their toughest technological challenges. We succeed when they succeed.\n\nCommunity:  \n\nGive More. \n\nWe are all connected. We approach each other with open minds and humble hearts. We serve by dedicating our time, talent, and energy, creating a thriving community together.\n\n\nOur workplace provides a great foundation for learning, teamwork, collaboration, openness and fun. While each workplace is different, several commonalities are found throughout our locations:\neco-friendliness, \nopen doors, \nshared offices, \ncomfortable communal spaces, \ngame, relaxation and mother's rooms, \nwellness & community programs, \nfree healthy snacks and drinks, \nonsite cafes and services, \nweekly social gatherings, \n and quarterly all-hands meetings."}, {"company_name": "Facebook", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Menlo Park, California", "size_text": "30,275 Employees", "industry_text": "", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "Founded in 2004, Facebook’s mission is to give people the power to build community and bring the world closer together. People use Facebook to stay connected with friends and family, to discover what’s going on in the world, and to share and express what matters to them.", "culture_text": "We don't have rules, we have values.\n\nFocus on Impact: To have the biggest impact, we need to focus on solving the most important problems. It sounds simple, but most companies do this poorly and waste a lot of time. We expect everyone at Facebook to be good at finding the biggest problems to work on.\n\nMove Fast: We have a saying: “Move fast and break things.” The idea is that if you never break anything, you’re probably not moving fast enough. At Facebook, we’re less afraid of making mistakes than we are of losing opportunities.\n\nBe Bold: We have another saying: “The riskiest thing is to take no risks.” In a world that’s changing so quickly, you’re guaranteed to fail if you don’t take any risks. We encourage everyone to make bold decisions, even if that means being wrong some of the time.\n\nBe Open: We believe that a more open world is a better world. The same goes for our company. Informed people make better decisions and have a greater impact, which is why we work hard to make sure everyone at Facebook has access to as much information about the company as possible.\n\nBuild Social Value: Facebook was created to make the world more open and connected, not just to build a company. We expect everyone at Facebook to focus every day on how to build real value for the world in everything they do."}, {"company_name": "Infosys", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Bangalore, India; US Plano, TX", "size_text": "10,001+ Employees", "industry_text": "Information Technology, Software and Services", "visa_sponsorship_text": "n/a", "hiring_text": "Hiring", "positions_text": "System Engineers\nSoftware Programmers\nTechnical Staff\nSoftware Developers\nIT\nResearch\nData Scientists", "about_text": "\u0016Infosys is a global leader in consulting, technology, and outsourcing and next-generation services. We enable clients in more than 50 countries to outperform the competition and stay ahead of the innovation curve. We provide enterprises with strategic insights on what lies ahead. We help enterprises transform and thrive in a changing world through strategic consulting, operational leadership, and the co-creation of breakthrough solutions, including those in mobility, sustainability, big data, and cloud computing.", "culture_text": "Technology firms servicing large corporates have for far too long followed orders, delivering only what's asked of them. At Infosys, we're committed to changing that. Where others work for their clients, we work with our partners. Where some function as service providers, we act as advisors. And where some believe in doing as told, we believe in thinking about what needs to be done. This is how we take innovation down to the grassroots and make it a part of everything we do, every day. \nBeyond Business\nWe believe that organizations need to focus on more than their 90-day rhythms, and emphasize on generating real value and impacting lives instead.Creating a diverse workplace\nWe welcome people of varying genders, nationalities, and religious beliefs with equal enthusiasm. It is not just the right thing to do, but the smart thing to do."}, {"company_name": "Rocket Mortgage by Quicken Loans", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Detroit, MI", "size_text": "10,000+ Employees", "industry_text": "Tech, Finance", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "At Rocket Mortgage, you’re empowered to find solutions that make our teams stronger and more inventive every day. It’s because of the drive and determination of people like you that we’ve made the top 30 of Fortune magazine’s annual ranking of the 100 Best Companies to Work For list for 15 consecutive years.\n \nMore than 17,000 hardworking professionals work across our suite of fintech services. Collectively, with nearly 100 other companies across a broad range of industries, we make up the Rock Family of Companies – all united by an obsession to find a better way for our clients, our team members and our communities.", "culture_text": ""}, {"company_name": "Uber", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "San Francisco, CA", "size_text": "18,000 Employees", "industry_text": "Technology", "visa_sponsorship_text": "yes!", "hiring_text": "", "positions_text": "", "about_text": "Uber’s mission is to bring reliable transportation to everywhere, for everyone. We started in 2010 to solve a simple problem: how do you get a ride at the touch of a button? Six years and more than five billion trips later, we’ve started tackling an even greater challenge: reducing congestion and pollution in our cities by getting more people into fewer cars.", "culture_text": ""}, {"company_name": "Tata Consultancy Services", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "North America", "size_text": "10,001+ Employees", "industry_text": "Information Technology and Services", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "We are a renowned tech-company that you probably haven't heard of... Tata Consultancy Services (TCS) is an IT services, engineering consulting and business solutions organization that delivers real results to global business, ensuring a level of certainty no other firm can match. TCS offers a consulting-led, integrated portfolio of IT, BPS, infrastructure, engineering and assurance services. This is delivered through its unique Global Network Delivery Model™, recognized as the benchmark of excellence in software development.", "culture_text": "So what are we made of...\n\n\n• We have 324,000+ WORLD’S BEST-TRAINED IT CONSULTANTS\n• We operate in 46 COUNTRIES \n• Our clients represent 7 OF THE TOP 10 FORTUNE 500 U.S. COMPANIES\n• Our clients represent 6 OF THE TOP 10 FORTUNE GLOBAL 500 COMPANIES\n• We are 57th in the TOP 500 US BRANDS study by Brand Finance\n• We have 100,000+ (33.5%) FEMALE Employees\n• Approximately 70% OF EMPLOYEES ARE UNDER 28\n• We represent 124 NATIONALITIES\n• We have earned $15.5 Billion REVENUE (fiscal year ending March 31, 2015)\n• We maintain 99% RETENTION RATE among more than 1,000 clients"}, {"company_name": "Genentech", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "South San Francisco, California", "size_text": "10,001+ Employees", "industry_text": "", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "Considered the founder of the industry, Genentech, now a member of the Roche Group, has been delivering on the promise of biotechnology for over 40 years.\n\nWe're passionate about finding solutions for people facing the world's most difficult-to-treat conditions. That is why we use cutting-edge science to create and deliver innovative medicines around the globe. To us, science is personal.", "culture_text": "SCIENCE IS PERSONAL: PEOPLE\nPeople make Genentech what it is. \nPeople come to Genentech from across disciplines and across the world to solve our most challenging medical conditions. You’ll find inspiration in our passion for biotechnology, our purpose to positively impact the lives of millions of patients, and our dedication to our people. Plus, you’ll thrive in our one-of-a-kind culture, where diversity is celebrated, employees are valued for their contributions, and we all serve as advocates for change who continually find ways to do things better."}, {"company_name": "Optiver", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Amsterdam", "size_text": "950+ Employees", "industry_text": "Financial Services, Technology", "visa_sponsorship_text": "Legal authorization to work in the U.S. is required.", "hiring_text": "Software Development, Trading, IT Operations, Quantitative Research and Development, Internships", "positions_text": "", "about_text": "Optiver is a global electronic market maker. We use our own capital, at our own risk, to trade on major financial markets around the world. Our story begins in 1986, with a single trader on the floor of Amsterdam's options exchange. Today, we are at the forefront of trading and technology, employing around 950 employees of 40 nationalities across offices on four continents. How did we get here? With an unwavering focus on continuous development and our mission to improve the market. We stick to what we're good at: making markets in a wide range of financial products. This clear focus has always served us well. We use our own capital, at our own risk, to trade on major financial markets around the world. By constantly providing liquidity, volume and competitive prices, we contribute to the stability and smooth functioning of fair, transparent and reliable markets. Our innovative trading systems are key to our success, enabling us to respond swiftly to every change in the market. Optiver has thrived because of our company's ability to attract, retain and bring together some of the brightest minds. We pride ourselves on our company culture - together we form the Optiver community. Our working atmosphere is informal and our structure is flat - what you bring to the table is more important than where you've come from or what you're wearing. We have the flexibility we need to be creative and to excel, due to minimal bureaucracy and open communication lines. We prize feedback and encourage collaboration - both elements are part of our focus on continuous improvement. And we all have a vested interest in the future of our company, as we share both the challenges and the rewards. It's up to all of us to do our best to improve the market, every day. We employ individuals from around the world and with a wide range of backgrounds. We value and respect the diversity, open-minded culture and different points of view that our employees bring.", "culture_text": "Optiver’s culture is one of our most valuable assets. Our atmosphere is informal and our structure flat. Employees have the flexibility they need to be creative, research their ideas and then act upon them. We offer an ideal working environment for ambitious people who want to reach their full potential. We employ individuals from different countries and a wide range of backgrounds. We value the diversity and open-minded culture that our employees create.\nBenefitsHere are just some of the benefits enjoyed by Optiver's employees:\n\nCasual dress\nBreakfast & lunch catered daily in our kitchen\nMultiple pantries filled with a variety of complimentary snacks and beverages\nWeekly in-house chair massages\nCommuter benefits\nGame room with a pool table, foosball, ping pong table, video games and more\nNumerous social events including our annual Optiver Weekend, holiday party, summer party and quarterly expiration parties (trivia nights, game nights and happy hours, just to name a few)\nWellness Programs that include annual participation in the Chase Corporate Challenge and internal competitions\nExcellent medical benefits (including dental and vision), disability and life insurance coverage\n401K plan with very generous company match"}, {"company_name": "GE Digital", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "San Ramon, CA", "size_text": "10,001+ Employees", "industry_text": "Software and Digital Technology", "visa_sponsorship_text": "Will consider for certain roles.", "hiring_text": "", "positions_text": "Interns/Coops, Software Engineers, Digital Technology Leadership Program", "about_text": "GE is the world's digital industrial company, transforming industry with software-defined machines and solutions that are connected, responsive and predictive. With people, services, technology and scale, GE delivers better outcomes for customers by speaking the language of industry.\n \nGE Digital is the leading software company for the Industrial Internet. The company develops software to design, build, operate and manage the entire asset lifecycle – enabling businesses across the energy, aviation, healthcare and manufacturing sectors to operate faster, smarter and more efficiently. All of industry will have to master digital to compete in the future by moving beyond automation to autonomous systems. GE Digital is a critical part of GE’s present and future by helping industrials unlock machine data to turn valuable insights into powerful business outcomes.\n \nHeadquartered in San Ramon, California, GE Digital is a global team of more than 26,000 with offices in Paris, Shanghai, Bangalore, New Orleans, Budapest and Detroit. We are defining what digital means in an industrial world. Together, we work to build the future.", "culture_text": "We’re big, but our entrepreneurial culture allows people to work in small teams, move around and collaborate to build new products, constantly experimenting and iterating, all while enjoying the unparalleled resources, industry knowledge, data and brand of the innovative 125 year-old company that built the first light bulb, jet engine and x-ray machine.\n\nIt's not just something you study but what you do. When you join GE Digital, you join a community of people dedicated to solving the world's biggest problems.\n\nThis fosters a certain sense of camaraderie, and it shows.The design of our offices reflect our culture of collaboration and commitment to innovation. Teams sit together in open work spaces to encourage dialogue and the flow of ideas. \n\nConnect with your co-workers through various employee events, such as happy hours, as well as employee interest and affinity groups, including the Women's Network, African American Forum (AAF), Hispanic Forum (HF), Asia Pacific American Forum (APAF), Gay, Lesbian, Bi-Sexual, Transgender, and Ally Alliance (GLBTA), and Veteran's Network."}, {"company_name": "LiveRamp", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "San Francisco, CA", "size_text": "51-200 Employees", "industry_text": "Big Data Analytics; Advertising Platforms", "visa_sponsorship_text": "", "hiring_text": "Fall/Winter/Spring Internship, Summer Internship, and New Grad only", "positions_text": "Software Engineering, Rotational Program", "about_text": "LiveRamp believes in the power of connected data. We unify customer data across disparate applications, enabling a new generation of marketing tools. Our goal is to empower brands to seamlessly leverage their marketing data to delight customers with relevant and singular experiences.\n\nLiveRamp is the leading data onboarder, empowering marketers to use their customer database in their choice of online advertising platforms for targeting, ROI measurement, content optimization and more. We offer 1-to-1 exact user matching with privacy compliance, while retaining the highest match rates in the industry and are the only company solely focused on onboarding data safely, securely, and accurately.\n\nWe're always looking for smart and compassionate people to help us blaze a trail. Learn more about working here. ", "culture_text": "We believe that life is too short not to work with a great team of people. We are dedicated to creating a fun, collaborative environment and being the technology leaders, solving the biggest problems in Big Data.\n\nCheck out our blog to get a taste of some of our recent exploits. Try out our challenge problems to see if you have what it takes to join our team.\n\nIf you are as respectful, collaborative and driven as you are brilliant, consider joining our team. We are looking for full-time engineers and interns (summer or any time of year).\n\nCheck out more photos of our new SF office and learn about various positions here."}, {"company_name": "IMC", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Amsterdam", "size_text": "500 Employees", "industry_text": "Finance", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "Quantitative Trader, Software Developer", "about_text": "Make an impact in a business where ideas matter more than job title.\n\nIMC is a leading market maker, active on over 100 exchanges around the world. Founded in Amsterdam in 1989, IMC was one of the first to value the importance of technology and innovation in the evolution of trading. As we invested we grew, from 2 to more than 500. Today we operate globally – across time zones and continents.\n\nCutting edge technology is at the heart of everything we do, but it's our values that bind us. Every day our people challenge what's possible, developing and delivering the systems and strategies that have made us one of the world’s leading liquidity providers for 25+ years.\n\nIf you have a passion for trading and technology and want to put to your talent to work where it can make a real difference, IMC is for you. We value openness, honest discussion and teamwork, and our training and development programs reflect those values. Our investment in our people starts on day one and continues throughout their careers - you’ll get everything you need to fulfill your potential.\n\nYou will also have the opportunity to work on global teams to learn and share ideas with some of the best traders, developers and technologists from around the world. IMC people love what they do and they do it best in a challenging, creative environment where talent is recognized and rewarded.\n\nDoes this sound like you? We’ll provide every opportunity; you bring every one of your talents.", "culture_text": "Across our offices in Amsterdam, Chicago and Sydney, teams of technologists and traders work together to design and develop the software, hardware, advanced networks and algorithms that drive our trading strategies. They anticipate change and continuously innovate, seeking new ways to sustain our success. At IMC we recognize the best ideas regardless of hierarchy. We hire outstanding people, give them a lot of responsibility and listen to everyone who speaks up.\n \nOur benefits program is in place to make life worry-free for our people, allowing them to focus on what they’re most passionate about. We go beyond the basics to support a healthy lifestyle physically, emotionally, and socially. \n \nA Healthy Lifestyle: \n·         Medical, Vision, Dental insurance fully covered by IMC·         25 paid days off a year·         Free meals and snacks throughout the day·         Free gym membership·         Commuter benefits·         Massage therapist on site·         Meditation room\n\n      While Making Life Fun (to name a few): \n·         Opportunities to work in offices abroad (Amsterdam, Sydney)·         Friday happy hour with appetizers and drinks at our IMC bar·         Ping pong, pool table, & video games to help unwind in the office·         Annual Christmas gift·         Annual events with spouses included- Christmas and Summer Picnic·         Company outings- sporting events, concerts, restaurants to name a few·         IMC Sport Teams ·         Annual company trip - past trips have included Las Vegas, Miami, and Arizona\n\nFollow us on Instagram and Facebook @IMCTrading to get to know us better. "}, {"company_name": "Juniper Networks", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Sunnyvale, CA", "size_text": "5001-10,000 Employees", "industry_text": "Technology; Networking Equipment", "visa_sponsorship_text": "", "hiring_text": "FT, Interns", "positions_text": "", "about_text": "Founded in 1996, Juniper Networks is leading the revolution in networking, making it one of the most exciting technology companies in Silicon Valley today. Juniper's mission is to create more innovative products and solutions that meet the growing demands of the connected world. Juniper is now paving the way with the New Network, an architecture that is comprised of numerous hardware innovations. It is supported by a consistent, unique operating system called Junos, as well as client and server-based software products that enhance network performance and user experience.\n\n\nJuniper Networks is headquartered in Sunnyvale, California, with over 9,000 employees working across 70 countries. The world's top 100 service providers - the biggest and busiest wireline and wireless carriers, cable and satellite operators, content and Internet service providers, and cloud and data centers - run on Juniper Networks. Our customer base is also comprised of major banks and other global financial service organizations, 7 of the 8 largest stock exchanges in the world, U.S. government agencies and federal organizations, healthcare and educational institutions, energy and utility companies, and 99 of the Fortune Global 100.\n\nWorking at Juniper is more than just doing a job. Working at Juniper is answering an invitation to change the world — and yourself at the same time. It's our responsibility as an organization to create the right climate for our people to do their best work - and we try every day to encourage the best out of our colleagues. If this opportunity is something you'd like to take on, we invite you to contact us to talk further.", "culture_text": "Connecting technology—and people.\n\nAt Juniper, we make the advanced technologies that give organizations the power to connect, solve problems, and capture opportunities.\n\nBut we also empower people to connect their ideas to the world around them and bring their vision to life. The network is the point where technology and people meet, and what results can be truly amazing.\n\nAs a company, Juniper’s mission is to connect everything and empower everyone. As an employer, we strive to help people forge meaningful connections that advance their careers, elicit recognition, and engage the greater community in ways that make a real difference in people's lives.\n\n* * * * * * * \n\nUniversity Recruiting\n\nNew talent is the lifeblood of the technology industry. By embracing the next generation of network developers and connecting with their passion, we’re building the pipeline of high-caliber talent that is vital for innovation. We’re also committed to helping develop that talent grow and flourish."}, {"company_name": "AT&T", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Dallas, TX", "size_text": "10,000 Employees", "industry_text": "Telecommunications", "visa_sponsorship_text": "", "hiring_text": "Full-Time, Interns", "positions_text": "", "about_text": "AT&T is a telecommunications company that provides wireless communications, local exchange, and long-distance services for consumers and businesses in the United States and internationally. For more than a century, we have consistently provided innovative, reliable, high-quality products and services and excellent customer care.\n\nToday, our mission is to connect people with their world, everywhere they live and work, and do it better than anyone else. We're fulfilling this vision by creating new solutions for consumers and businesses and by driving innovation in the communications and entertainment industry. As part of our team, you’ll create and develop the technology that changes lives. From healthcare mobile apps to innovative products, you’ll make the impossible possible.", "culture_text": "At AT&T, our passion to serve extends beyond our customers to our employees. AT&T's 137-year history of innovation is a story about people from all walks of life and all kinds of backgrounds coming together to mobilize a world that works for people. It is our diverse, inclusive culture that welcomes all points of view, that makes us who we are: a great place to work, a desired business partner and a committed member of the communities we serve. Read more about our view of diversity here.\n\nIn 2007, our CEO, Randall Stephenson, made a decision that our company would focus on continuous learning. This decision would support our philosophy to provide ongoing opportunities to grow and develop existing employees through employee training, development programs and tuition assistance for employees. Learn more about Talent Development here.\n\nOur AT&T Development Programs & Internships are all about shaping our future leaders, while providing plenty of learning opportunities, on-the-job training, and mentorship programs with senior members of the organization."}, {"company_name": "Snap Inc.", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Venice, CA", "size_text": "501 to 1000 Employees", "industry_text": "", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "Snap Inc. is a camera company.\n \nWe believe that reinventing the camera represents our greatest opportunity to improve the way people live and communicate. Our products empower people to express themselves, live in the moment, learn about the world, and have fun together.", "culture_text": "At Snap Inc., we have a fun, creative, and comfortable environment for our talented team. Every day we work on a product that reaches millions of users, and aims to change the way people communicate."}, {"company_name": "Whirlpool", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Benton Harbor, Michigan", "size_text": "10,000+ Employees", "industry_text": "", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "For generations, Whirlpool Corporation has been helping people make the most of time so they can focus on what really matters – their families and their lives. “There is no right way to do a wrong thing” has guided everything we do, and for generations to come, we will sustain our commitment to make each experience an extraordinary one. Whirlpool Corporation is the number one major appliance manufacturer in the world, with approximately $21 billion in annual sales, 97,000 employees and 70 manufacturing and technology research centers in 2015. The company markets Whirlpool, KitchenAid, Maytag, Consul, Brastemp, Amana, Bauknecht, Jenn-Air, Indesit and other major brand names in nearly every country throughout the world. Additional information about the company can be found on Twitter at @WhirlpoolCorp and WhirlpoolCorp.com.", "culture_text": "For generations, we have been a company that thrives on collaboration, relationships and teamwork. In order to achieve continued and sustainable business growth, we need to build strong, diverse teams and manage an increasingly dispersed global workforce. We are committed to creating a winning workplace and improving the experiences of our entire workforce. To achieve our vision, we are investing in the latest tools, technologies and processes that foster flexibility so every employee can work the way they live and achieve their best."}, {"company_name": "MongoDB", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "New York, NY", "size_text": "900 Employees", "industry_text": "Database, SaaS", "visa_sponsorship_text": "", "hiring_text": "Full-time and Interns", "positions_text": "Summer Internships (Software Engineering, Design, Product Management, Marketing and Sales), New Grad Positions (Software Engineering)", "about_text": "MongoDB is the leading modern, general purpose database platform, designed to unleash the power of software and data for developers and the applications they build. Headquartered in New York, MongoDB has more than 5,700 customers in over 90 countries. The MongoDB database platform has been downloaded over 35 million times and there have been more than 850,000 MongoDB University registrations.", "culture_text": "Our Values:\n\n\nThink Big, Go Far\nMake it Matter\nBuild Together\nEmbrace the Power of Differences\nBe Intellectually Honest\nOwn What You Do\n\n\nIf you love to build, innovate, work with an amazing team, and bask in the glory of genuine achievement, you've come to the right place. MongoDB is built for that kind of significant success.\n\nWe achieve success by bringing together a distinctive mix of diverse skills, experiences, and backgrounds. We work as a team––creating an open forum for innovative thought, candid discussion, and mutual respect. But in the end, we always put commitment over consensus, and value excellence in all its wonderful forms.\n We strive to build something amazing, to work on hard, tackle interesting problems, and to surround ourselves with bright people. Our work is challenging, but that’s what makes it fun."}, {"company_name": "Quora", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Mountain View, CA", "size_text": "130 Employees", "industry_text": "Social Media; Search; Q&A; Knowledge Management", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "Quora is a group of exceptionally talented people all working together to share and grow the world's knowledge. We believe our progress toward this mission will have a great long-term impact on the world. When people have access to more knowledge, they can make better decisions, find better jobs and do them better, solve problems in their life, raise their families better, and much more. Knowledge is important to the world and the downstream effects of increased access to it are huge.\nQuora is your best source of knowledge. Ask any question, get real answers from people with first hand experience, and blog about what you know.", "culture_text": "As a team, we are dedicated to holding high standards, developing a strong and passionate culture, and emphasizing impact. Reflecting this, a Quora internship is not an ordinary internship. There's no busy work. Every project that our interns work on is important to the company and its goals.\nMore generally, we have a number of key values that drive the company forward.\nMaximize long-term value. We are building a product that we hope lasts forever. We want to be a strong and independent company. This long term focus guides all of the decisions we make. Continuously learn and adapt. We value experimentation, metrics-driven decisions, and speed of iteration. We push to production with every commit so we launch as soon as work is done and learn as quickly as possible. Execute. We value people who have great ideas but who also can quickly drive them all the way to implementation. Hold high standards. We hire the best people. We set aggressive goals. We aspire to do our best work every day. Be direct and respectful. We expect and welcome constant feedback. We trust each other to be open and straightforward."}, {"company_name": "Point72", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Stamford, CT", "size_text": "+1250 Employees", "industry_text": "Finance and Investing", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "Point72 invests in Discretionary Long/Short and Macro strategies, and Systematic strategies through our quantitative investing business, Cubist.\n\nWe’re inventing the future of finance by revolutionizing how we develop our people and how we use data to shape our thinking. \n\nJoin our team to innovate, experiment, and be the best at what you do.", "culture_text": "Point72 rests on the inseparable principles of excellence and integrity – each reinforces the other to create a culture of opportunity.\n\n“The words in our Mission and Values are literally words for us to live by. If we do so, we will not only be a great Firm, but set the standard for the rest of the industry.”\n \n - Steve Cohen, Chairman, Chief Executive Officer, and President\n\n\nOur Mission\n\nTo be the industry’s premier asset management firm through delivering superior risk-adjusted returns, adhering to the highest ethical standards and offering the greatest opportunities to the industry’s brightest talent.\n\nOur Values\n\nEthics & Integrity\nWe are professionals who conduct ourselves ethically and with integrity at all times.\n\nFirm First\nWe operate as one firm, dedicated to succeeding together, with mutual respect and commitment.\n\nInnovation & Excellence\nWe are not satisfied with the status quo and are committed to pursuing innovation and excellence.\n\nGrowth & Development\nWe work together to advance our professional and personal development.\n\nCommunity\nWe are exemplary citizens of the world and contribute to the communities in which we live and work.\n "}, {"company_name": "Pinterest", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "San Francisco, CA", "size_text": "500 Employees", "industry_text": "Curated Web; E-Commerce; Social Commerce;", "visa_sponsorship_text": "Yes", "hiring_text": "Software Engineers (New Grads and Interns)", "positions_text": "Software Engineering", "about_text": "At Pinterest, we help people discover and do the things they love. Whether you’re passionate about graphic design, motorcycles, or vintage records, there’s something for you on Pinterest.Tech translation: we’re building a powerful discovery tool. We connect millions of people to billions of objects, and we’re scaling like crazy.\n\nCheck out our engineering site here. ", "culture_text": "Pinterest is a company of makers.  We are building a product that will fundamentally change the web and we're inspired by the impact Pinterest has on people’s lives.  Pinterest gives people the spark to explore “in real life” the things they discover online—whether that’s a new recipe, a new place to visit, or a new hobby.  We strive to empower people to be aspirational and seek out the things they love.\n\nThe best products we’ve built are a result of people from different teams working closely with one another. We insist on an open, curious culture where everyone - from engineering and design to marketing to community - matters and works together. All PMs, designers and engineers work together to put pinners first.  You will work on a team with great people who also happen to be awesome at what they do.  You’re building products for tens of millions of people, so there’s a huge opportunity. \n\nSometimes the best way to find out if something works is just go do it. Our process is iterative, and we’re constantly learning from the things we try. We want Pinterest to be useful for people around the world, however they choose to be inspired.  We’re building our company to make that happen.\n\nThere’s a lot of talent and mentorship - you work side by side with engineers who bring a ton of experience. The teams are small, so each person can have a big impact and engineers touch all parts of a product. \n\nWe are located in sunny San Francisco, California."}, {"company_name": "Teradata", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "San Diego, CA", "size_text": "10,001+ Employees", "industry_text": "Information Technology and Services", "visa_sponsorship_text": "", "hiring_text": "Interns and New Graduates", "positions_text": "Software development and engineering", "about_text": "Teradata is a global leader in analytic data platforms, marketing and analytic applications, and consulting services. We help organizations know more so they can do more of what’s really important. \n \nTeradata has more than 10,000 employees in 43 countries and we are keenly focused on helping our more than 2,500 customers drive value from data. Our team includes the brightest minds in the industry … driven by unmatched enthusiasm and commitment to innovation and our customers.", "culture_text": "It’s no secret that the people of Teradata make our company great. We think differently. We ask questions. Our work environment is fast-paced, flexible and fun and our commitment to excellence extends far beyond the boundaries of our jobs.\n\nLearn more about what your summer at Teradata can look like: \nTeradata Summer Internship Program\n\n\nLooking for full time opportunities? Here's also a sneak peak into our culture and life at Teradata:\nTeradata Early Career Opportunities & Culture"}, {"company_name": "DRW", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Chicago, IL", "size_text": "501-1000 Employees", "industry_text": "", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "DRW is a technology-driven, diversified principal trading firm. We trade our own capital at our own risk, across a broad range of asset classes, instruments and strategies, in financial markets around the world. As the markets have evolved over the past 25 years, so has DRW – maximizing opportunities to include real estate, cryptoassets and venture capital. With nearly 900 employees at our Chicago headquarters and six global offices, we work together to solve complex problems, challenge consensus and deliver meaningful results. It’s a place of high expectations, deep curiosity and thoughtful collaboration.  ", "culture_text": "DRW combines the best of both worlds: the opportunity and spirit of a startup and the stability of an established, experienced firm. Our employees work hard to solve interesting problems, and their results are rewarded. We value continuous learning—from our outcomes, from the environment and from each other.\n\nOur benefits & perks mean you'll grow professionally and enjoy good times with colleagues:\n\n\nSummer training program\nSpeaker Series and \"Geek Lunches\"\nDaily catered breakfast, lunch and snacks\nWine tasting and trivia nights\nGame tournaments\nOn-site yoga classes\nMentor / mentee outings\nChair massages\nVolunteer opportunities\nTuition reimbursement\nLearn more about the full DRW benefits package"}, {"company_name": "AppNexus", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "New York, NY", "size_text": "1,000 Employees", "industry_text": "Ad Tech", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "AppNexus is an internet technology company that enables and optimizes the real-time sale and purchase of digital advertising. Our powerful, real-time decisioning platform supports core products that enable publishers to maximize yield; and marketers and agencies to harness data and machine learning to deliver intelligent and customized campaigns. Headquartered in New York City, AppNexus employs over 1000 professionals in offices spanning five continents.", "culture_text": "AppNexians are passionate about and thrive in a culture of learning and teaching. We constantly challenge ourselves to improve. We love to learn and share knowledge to empower others. We take risks when looking for novel and creative solutions to complex problems. We look beyond the surface to understand root causes so that we can build complete and long-term solutions. AppNexians are part of an organization with a transparent and agile environment where we communicate freely. "}, {"company_name": "NVIDIA", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Santa Clara, CA", "size_text": "8000 Employees", "industry_text": "", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "NVIDIA is a world leader in visual computing. Our technologies are transforming a world of displays into a world of interactive discovery for everyone from gamers and scientists, to consumers and enterprises. We invest in our people, our technologies, and our research and development efforts to deliver the highest quality products to customers across the globe.\n\nNVIDIA's culture inspires our team of world-class engineers and developers to be at the top of their game. We've created an environment where talents are recognized and collaboration is valued. Our employees are shaping the world of tomorrow, today. We invite you to explore the opportunities available at NVIDIA - just click on the link to see what your future may hold.", "culture_text": "At NVIDIA, we work, think and learn as a team. We thrive in an extremely high performance environment and we're driven by a culture that demands innovation and the highest standards. The rewards are sweet and include collaborating with some of the smartest people in the industry, an aggressive compensation plan that rewards top performers, and the opportunity to work on products that transform the way people work and play.\n\nNVIDIA makes it easy for new college graduates to quickly make an impact by offering a thorough orientation program and several learning and development opportunities. The opportunities are endless. We provide you with the tools to build a career your way. Our unique organizational structure makes it possible for graduates to interact with NVIDIA leaders directly. There is no limit to the direction your career can take as your experience grows and your interests develop."}, {"company_name": "Nutanix", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "San Jose, CA", "size_text": "2,000 + Employees", "industry_text": "Enterprise Software, Storage, Virtualization", "visa_sponsorship_text": "yes", "hiring_text": "Full-time and Interns", "positions_text": "All Roles", "about_text": "Nutanix makes infrastructure invisible, elevating IT to focus on the applications and services that power their business. The Nutanix enterprise cloud platform leverages web-scale engineering and consumer-grade design to natively converge compute, virtualization and storage into a resilient, software-defined solution with rich machine intelligence. The result is predictable performance, cloud-like infrastructure consumption, robust security, and seamless application mobility for a broad range of enterprise applications.Learn more about us at www.nutanix.com or via social media (Twitter: @Nutanix & Instagram: @nutanix).\n    \n ", "culture_text": "Life at Nutanix\n\n\n\nLife at Nutanix is collaborative, fast-paced and rich in opportunity. Ours is an open culture where a willingness to experiment, can-do attitude and commitment to living our core values—Hungry, Humble, Honest—set us apart from other organizations. With the company growing so quickly, it's important for us to hire people who can make an impact. So whether you're looking for an internship, entry-level or professional position, you can be confident that every role matters and your input is valued."}, {"company_name": "Adobe", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "San Jose, CA", "size_text": "19,000+ Employees", "industry_text": "Technology", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "Adobe is the global leader in digital media and digital marketing solutions. Our creative, marketing and document solutions empower everyone – from emerging artists to global brands – to bring digital creations to life and deliver immersive, compelling experiences to the right person at the right moment for the best results. In short, Adobe is everywhere, and we’re changing the world through digital experiences.", "culture_text": "When describing the culture here at Adobe, we like to call it the Adobe Life. The diversity of Adobe is inspiring. Our community is made up of thousands of unique individuals with different talents, skills, and backgrounds, all working toward a common purpose. And despite our differences, we have some big things in common: a love of challenge, an intense curiosity, an ability to dream up ground breaking ideas, and a competitive streak that keeps Adobe at the forefront of the digital media and digital marketing industries.\n \nThe Adobe community is like a kaleidoscope. Every detail is rich, vibrant, and unique, and when we put them together, they create a magnificent picture that is more than the sum of its parts. We understand and value all the parts of the whole. That they are Adobe Life.  \nAsk anyone who has ever worked here—especially the hundreds of “boomerangs” who left and came back—and they’ll tell you: Adobe is an unusual place. We’re a big city brand with small-town values. We have a culture of innovation, expertise and leadership, but it’s also a culture of dedication, collaboration, respect, and a desire to give back to the people we work with and our communities.\n \nWhen you join Adobe, you can look forward to working with amazing:\n \nPeople: We are exceptional people who work better together.\n \nPurpose: We provide endless opportunities for you to make an impact.\n \nPride: We are transforming how people and brands everywhere tell their story."}, {"company_name": "Bridgewater", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Westport, CT", "size_text": "1400 Employees", "industry_text": "Finance, Investment Banking", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "Founded in 1975 out of a two-bedroom apartment, Bridgewater remains an independent, employee-run organization. Throughout its 43-year history, Bridgewater has been recognized as a top-performing manager and an industry innovator, winning over 40 industry awards in the past five years alone. \nTechnology is central to Bridgewater’s mission. Our Technologists get involved in creative problem solving directly with the people using our systems. From lightning-fast trade processing platforms to cutting-edge data visualization and manipulation tools, we need talented builders and shapers who can punch through some of the most difficult technical problems and innovation challenges around and produce solutions that make real-world impact throughout our business. \n\nWith so many different technology specialties and problem sets at Bridgewater – from our Technology Associate Program to our Application Development, Infrastructure/Operations and Technology Management opportunities, you have the ability at Bridgewater to explore what’s right for you and what development path will suit you best. ", "culture_text": "At Bridgewater, our overriding objective is excellence, or more precisely, constant improvement. We believe that producing excellence requires approaching both work and people in a principled way. Above all else, we want to find out what is true and figure out how best to deal with it. We value independent thinking and innovation, recognizing that independent thinking generates disagreement and innovation requires making mistakes.\nTo foster this thinking and innovation, we maintain an environment of radical openness, even though that honesty can be difficult and uncomfortable. At Bridgewater each individual has the right and the obligation to ensure that what they do and what we do collectively in pursuit of excellence makes sense to them. Everyone is encouraged to be both assertive and open-minded in order to build their understanding and discover their best path. The types of disagreements and mistakes that are typically discouraged elsewhere are expected at Bridgewater because they are the fuel for the learning that helps us maximize the utilization of our potential. It is through this unique culture that we have produced the meaningful work and meaningful relationships that those who work here and our clients have come to expect.\nRead about our Principles here.\nLearn more about our culture in these videos."}, {"company_name": "PayPal", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "San Jose, CA", "size_text": "10,000+ Employees", "industry_text": "", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "At PayPal, we believe that now is the time to democratize financial services so that moving and managing money is a right for all citizens, not just the affluent. We are driven by this purpose, and we uphold our cultural values of collaboration, innovation, wellness and inclusion as our guide for making decisions and conducting business every day. It is our duty and privilege to be customer champions and put those we serve at the center of everything we do.\n\nWe are one team that respects and values diversity of thought for everyone, everywhere, and we actively seek to create an energizing workplace that brings out the best in all of us. If you’re ready to shape the future of money, join the team at PayPal. We're proud to work here. You will be too.\n\nLearn more about our internship program here.", "culture_text": "We're a purpose-driven company whose beliefs are the foundation for how we conduct business every day.\n We hold ourselves to the highest ethical standards, to empower an open and diverse workplace, and strive to treat everyone who is touched by our business with dignity and respect. Our employees challenge the status quo, ask questions, and find solutions. We want to break down barriers to financial empowerment. \n "}, {"company_name": "Lockheed Martin", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Bethesda, MD", "size_text": "113,000 Employees", "industry_text": "Defense & Space", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "Headquartered in Bethesda, Md., Lockheed Martin is a global security and aerospace company that employs about 112,000 people worldwide and is principally engaged in the research, design, development, manufacture, integration and sustainment of advanced technology systems, products and services.\n\n\nAs a global security, aerospace, and information technology company, the majority of Lockheed Martin's business is with the U.S. Department of Defense and the U.S. federal government agencies. In fact, Lockheed Martin is the largest provider of IT services, systems integration, and training to the U.S. Government. The remaining portion of Lockheed Martin's business is comprised of international government and some commercial sales of our products, services and platforms.", "culture_text": "It takes a lot of mind power from multiple backgrounds to define what’s next. To promote the sharing of ideas, we foster a work environment that encourages differences and big-picture thinking. To this end, we always strive to:\nDo What’s Right: Being worthy of our customers’ trust is our top priority. To this end, we adhere to the highest ethical standards, abide by the laws of every country in which we do business, and strive to be responsible corporate citizens.\nRespect Others: Our success depends on the ability of our talented, skilled employees to function as a tightly integrated team. We embrace diversity and respect each other, our customers, our partners and suppliers we interact with.\n\nPerform With Excellence: The missions our customers rely on us to carry out are every bit as important to us as they are to them, and we approach every challenge determined to succeed."}, {"company_name": "Intuit", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Mountain View, CA", "size_text": "9,000 Employees", "industry_text": "Software", "visa_sponsorship_text": "", "hiring_text": "Full-time and Interns", "positions_text": "Software Engineering, UX Design, Product Management", "about_text": "Our mission is powering prosperity around the world. We build intuitive web, mobile, and cloud solutions that generate more money, more time, and more confidence for 46+ million people. Leveraging big data insights, machine learning, and powerful automation, we help consumers, small business owners, and the self-employed achieve their dreams of prosperity.\n\nWhether you work on our product and technology teams or in any role across the globe, you’ll play a part in designing and launching industry-leading products like Mint, TurboTax and QuickBooks in an agile environment with fast moving teams.", "culture_text": "Innovate for Impact, Design for Delight\n\nOur culture of innovation inspires everything we do. In fact, we like to think of ourselves as a 30-year-old start-up—because we may be big and established, but we are fast movers. We’re bold, creative and overflowing with fresh ideas that lead to products that improve the lives of millions. Working together in small teams with a “design first” approach, we are Innovation Catalysts. And we invite you to join us and use your own inventive ideas to help us solve important problems—and to help people do more, make more and be more.\n\nFind out how we encourage and support our employees in tapping into their own passions to help us grow the company while delighting customers around the world.\nLearn More\n "}, {"company_name": "Intuit", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Mountain View, CA", "size_text": "9,000 Employees", "industry_text": "Software", "visa_sponsorship_text": "", "hiring_text": "Full-time and Interns", "positions_text": "Software Engineering, UX Design, Product Management", "about_text": "Our mission is powering prosperity around the world. We build intuitive web, mobile, and cloud solutions that generate more money, more time, and more confidence for 46+ million people. Leveraging big data insights, machine learning, and powerful automation, we help consumers, small business owners, and the self-employed achieve their dreams of prosperity.\n\nWhether you work on our product and technology teams or in any role across the globe, you’ll play a part in designing and launching industry-leading products like Mint, TurboTax and QuickBooks in an agile environment with fast moving teams.", "culture_text": "Innovate for Impact, Design for Delight\n\nOur culture of innovation inspires everything we do. In fact, we like to think of ourselves as a 30-year-old start-up—because we may be big and established, but we are fast movers. We’re bold, creative and overflowing with fresh ideas that lead to products that improve the lives of millions. Working together in small teams with a “design first” approach, we are Innovation Catalysts. And we invite you to join us and use your own inventive ideas to help us solve important problems—and to help people do more, make more and be more.\n\nFind out how we encourage and support our employees in tapping into their own passions to help us grow the company while delighting customers around the world.\nLearn More\n "}, {"company_name": "Intuit", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Mountain View, CA", "size_text": "9,000 Employees", "industry_text": "Software", "visa_sponsorship_text": "", "hiring_text": "Full-time and Interns", "positions_text": "Software Engineering, UX Design, Product Management", "about_text": "Our mission is powering prosperity around the world. We build intuitive web, mobile, and cloud solutions that generate more money, more time, and more confidence for 46+ million people. Leveraging big data insights, machine learning, and powerful automation, we help consumers, small business owners, and the self-employed achieve their dreams of prosperity.\n\nWhether you work on our product and technology teams or in any role across the globe, you’ll play a part in designing and launching industry-leading products like Mint, TurboTax and QuickBooks in an agile environment with fast moving teams.", "culture_text": "Innovate for Impact, Design for Delight\n\nOur culture of innovation inspires everything we do. In fact, we like to think of ourselves as a 30-year-old start-up—because we may be big and established, but we are fast movers. We’re bold, creative and overflowing with fresh ideas that lead to products that improve the lives of millions. Working together in small teams with a “design first” approach, we are Innovation Catalysts. And we invite you to join us and use your own inventive ideas to help us solve important problems—and to help people do more, make more and be more.\n\nFind out how we encourage and support our employees in tapping into their own passions to help us grow the company while delighting customers around the world.\nLearn More\n "}, {"company_name": "Intuit", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Mountain View, CA", "size_text": "9,000 Employees", "industry_text": "Software", "visa_sponsorship_text": "", "hiring_text": "Full-time and Interns", "positions_text": "Software Engineering, UX Design, Product Management", "about_text": "Our mission is powering prosperity around the world. We build intuitive web, mobile, and cloud solutions that generate more money, more time, and more confidence for 46+ million people. Leveraging big data insights, machine learning, and powerful automation, we help consumers, small business owners, and the self-employed achieve their dreams of prosperity.\n\nWhether you work on our product and technology teams or in any role across the globe, you’ll play a part in designing and launching industry-leading products like Mint, TurboTax and QuickBooks in an agile environment with fast moving teams.", "culture_text": "Innovate for Impact, Design for Delight\n\nOur culture of innovation inspires everything we do. In fact, we like to think of ourselves as a 30-year-old start-up—because we may be big and established, but we are fast movers. We’re bold, creative and overflowing with fresh ideas that lead to products that improve the lives of millions. Working together in small teams with a “design first” approach, we are Innovation Catalysts. And we invite you to join us and use your own inventive ideas to help us solve important problems—and to help people do more, make more and be more.\n\nFind out how we encourage and support our employees in tapping into their own passions to help us grow the company while delighting customers around the world.\nLearn More\n "}, {"company_name": "Intuit", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Mountain View, CA", "size_text": "9,000 Employees", "industry_text": "Software", "visa_sponsorship_text": "", "hiring_text": "Full-time and Interns", "positions_text": "Software Engineering, UX Design, Product Management", "about_text": "Our mission is powering prosperity around the world. We build intuitive web, mobile, and cloud solutions that generate more money, more time, and more confidence for 46+ million people. Leveraging big data insights, machine learning, and powerful automation, we help consumers, small business owners, and the self-employed achieve their dreams of prosperity.\n\nWhether you work on our product and technology teams or in any role across the globe, you’ll play a part in designing and launching industry-leading products like Mint, TurboTax and QuickBooks in an agile environment with fast moving teams.", "culture_text": "Innovate for Impact, Design for Delight\n\nOur culture of innovation inspires everything we do. In fact, we like to think of ourselves as a 30-year-old start-up—because we may be big and established, but we are fast movers. We’re bold, creative and overflowing with fresh ideas that lead to products that improve the lives of millions. Working together in small teams with a “design first” approach, we are Innovation Catalysts. And we invite you to join us and use your own inventive ideas to help us solve important problems—and to help people do more, make more and be more.\n\nFind out how we encourage and support our employees in tapping into their own passions to help us grow the company while delighting customers around the world.\nLearn More\n "}, {"company_name": "Intuit", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Mountain View, CA", "size_text": "9,000 Employees", "industry_text": "Software", "visa_sponsorship_text": "", "hiring_text": "Full-time and Interns", "positions_text": "Software Engineering, UX Design, Product Management", "about_text": "Our mission is powering prosperity around the world. We build intuitive web, mobile, and cloud solutions that generate more money, more time, and more confidence for 46+ million people. Leveraging big data insights, machine learning, and powerful automation, we help consumers, small business owners, and the self-employed achieve their dreams of prosperity.\n\nWhether you work on our product and technology teams or in any role across the globe, you’ll play a part in designing and launching industry-leading products like Mint, TurboTax and QuickBooks in an agile environment with fast moving teams.", "culture_text": "Innovate for Impact, Design for Delight\n\nOur culture of innovation inspires everything we do. In fact, we like to think of ourselves as a 30-year-old start-up—because we may be big and established, but we are fast movers. We’re bold, creative and overflowing with fresh ideas that lead to products that improve the lives of millions. Working together in small teams with a “design first” approach, we are Innovation Catalysts. And we invite you to join us and use your own inventive ideas to help us solve important problems—and to help people do more, make more and be more.\n\nFind out how we encourage and support our employees in tapping into their own passions to help us grow the company while delighting customers around the world.\nLearn More\n "}, {"company_name": "Intuit", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Mountain View, CA", "size_text": "9,000 Employees", "industry_text": "Software", "visa_sponsorship_text": "", "hiring_text": "Full-time and Interns", "positions_text": "Software Engineering, UX Design, Product Management", "about_text": "Our mission is powering prosperity around the world. We build intuitive web, mobile, and cloud solutions that generate more money, more time, and more confidence for 46+ million people. Leveraging big data insights, machine learning, and powerful automation, we help consumers, small business owners, and the self-employed achieve their dreams of prosperity.\n\nWhether you work on our product and technology teams or in any role across the globe, you’ll play a part in designing and launching industry-leading products like Mint, TurboTax and QuickBooks in an agile environment with fast moving teams.", "culture_text": "Innovate for Impact, Design for Delight\n\nOur culture of innovation inspires everything we do. In fact, we like to think of ourselves as a 30-year-old start-up—because we may be big and established, but we are fast movers. We’re bold, creative and overflowing with fresh ideas that lead to products that improve the lives of millions. Working together in small teams with a “design first” approach, we are Innovation Catalysts. And we invite you to join us and use your own inventive ideas to help us solve important problems—and to help people do more, make more and be more.\n\nFind out how we encourage and support our employees in tapping into their own passions to help us grow the company while delighting customers around the world.\nLearn More\n "}, {"company_name": "Intuit", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Mountain View, CA", "size_text": "9,000 Employees", "industry_text": "Software", "visa_sponsorship_text": "", "hiring_text": "Full-time and Interns", "positions_text": "Software Engineering, UX Design, Product Management", "about_text": "Our mission is powering prosperity around the world. We build intuitive web, mobile, and cloud solutions that generate more money, more time, and more confidence for 46+ million people. Leveraging big data insights, machine learning, and powerful automation, we help consumers, small business owners, and the self-employed achieve their dreams of prosperity.\n\nWhether you work on our product and technology teams or in any role across the globe, you’ll play a part in designing and launching industry-leading products like Mint, TurboTax and QuickBooks in an agile environment with fast moving teams.", "culture_text": "Innovate for Impact, Design for Delight\n\nOur culture of innovation inspires everything we do. In fact, we like to think of ourselves as a 30-year-old start-up—because we may be big and established, but we are fast movers. We’re bold, creative and overflowing with fresh ideas that lead to products that improve the lives of millions. Working together in small teams with a “design first” approach, we are Innovation Catalysts. And we invite you to join us and use your own inventive ideas to help us solve important problems—and to help people do more, make more and be more.\n\nFind out how we encourage and support our employees in tapping into their own passions to help us grow the company while delighting customers around the world.\nLearn More\n "}, {"company_name": "Intuit", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Mountain View, CA", "size_text": "9,000 Employees", "industry_text": "Software", "visa_sponsorship_text": "", "hiring_text": "Full-time and Interns", "positions_text": "Software Engineering, UX Design, Product Management", "about_text": "Our mission is powering prosperity around the world. We build intuitive web, mobile, and cloud solutions that generate more money, more time, and more confidence for 46+ million people. Leveraging big data insights, machine learning, and powerful automation, we help consumers, small business owners, and the self-employed achieve their dreams of prosperity.\n\nWhether you work on our product and technology teams or in any role across the globe, you’ll play a part in designing and launching industry-leading products like Mint, TurboTax and QuickBooks in an agile environment with fast moving teams.", "culture_text": "Innovate for Impact, Design for Delight\n\nOur culture of innovation inspires everything we do. In fact, we like to think of ourselves as a 30-year-old start-up—because we may be big and established, but we are fast movers. We’re bold, creative and overflowing with fresh ideas that lead to products that improve the lives of millions. Working together in small teams with a “design first” approach, we are Innovation Catalysts. And we invite you to join us and use your own inventive ideas to help us solve important problems—and to help people do more, make more and be more.\n\nFind out how we encourage and support our employees in tapping into their own passions to help us grow the company while delighting customers around the world.\nLearn More\n "}, {"company_name": "Intuit", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Mountain View, CA", "size_text": "9,000 Employees", "industry_text": "Software", "visa_sponsorship_text": "", "hiring_text": "Full-time and Interns", "positions_text": "Software Engineering, UX Design, Product Management", "about_text": "Our mission is powering prosperity around the world. We build intuitive web, mobile, and cloud solutions that generate more money, more time, and more confidence for 46+ million people. Leveraging big data insights, machine learning, and powerful automation, we help consumers, small business owners, and the self-employed achieve their dreams of prosperity.\n\nWhether you work on our product and technology teams or in any role across the globe, you’ll play a part in designing and launching industry-leading products like Mint, TurboTax and QuickBooks in an agile environment with fast moving teams.", "culture_text": "Innovate for Impact, Design for Delight\n\nOur culture of innovation inspires everything we do. In fact, we like to think of ourselves as a 30-year-old start-up—because we may be big and established, but we are fast movers. We’re bold, creative and overflowing with fresh ideas that lead to products that improve the lives of millions. Working together in small teams with a “design first” approach, we are Innovation Catalysts. And we invite you to join us and use your own inventive ideas to help us solve important problems—and to help people do more, make more and be more.\n\nFind out how we encourage and support our employees in tapping into their own passions to help us grow the company while delighting customers around the world.\nLearn More\n "}, {"company_name": "Johnson Controls", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Milwaukee, WI", "size_text": "120,000 Employees", "industry_text": "Mechanical or Industrial Engineering", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "We’re driven to make tomorrow better. Our global team creates innovative, integrated solutions to make cities more connected, buildings more intelligent and vehicles more efficient. We are passionate about improving the way the world lives, works and plays. And we take pride in making Johnson Controls a vibrant, rewarding place to work. The future requires bold ideas, an entrepreneurial mind-set and collaboration across boundaries. You’ll work with the best and brightest from around the world to shape the future and your career. Tomorrow needs you.", "culture_text": "At Johnson Controls, every voice matters. Starting from the top, our leaders are authentic and passionate. They embrace new ideas and nurture a culture of innovation that fuels collaboration. We understand that ideas can and should come from every level within our company – it’s key to how we do business the right way. Our philosophy is simple – we provide products and services across the world, so our workforce needs to reflect varied cultures, thoughts, ideas and experiences to serve all markets."}, {"company_name": "Akamai Technologies", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Cambridge, MA", "size_text": "5,001-10,000 Employees", "industry_text": "Internet", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "Akamai® is the leading provider of cloud services for helping enterprises provide secure, high-performing user experiences on any device, anywhere. If you've ever shopped online, downloaded music, watched a web video or connected to work remotely, you've probably used Akamai's cloud platform.\n\nAkamai helps enterprises accelerate innovation in the hyperconnected world by removing the complexities of technology so you can focus on driving your business faster forward. We enable enterprises to capitalize on market opportunities presented by trends like mobile and cloud while overcoming the challenges presented by security threats and the need to reach users globally.", "culture_text": "We’re at the heart of the Internet, helping the most innovative companies remove the complexities of delivering any experience, to any device, anywhere. Founded in the halls of MIT, Akamai remains dedicated to a youthful optimism of problem solving through intellectual curiosity, collaboration and commitment. And we’re growing quickly. If you’d like to work in a culture where hard work and innovative ideas are consistently rewarded, join us and help shape the future of the hyperconnected world."}, {"company_name": "Illumina", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "San Diego, CA", "size_text": "6000+ Employees", "industry_text": "Biotech - Research, Clinical, and Diagnostics", "visa_sponsorship_text": "Yes, depending on role", "hiring_text": "Software Engineering, Web Developers, Cloud Developers, Bioinformatics, Electrical Engineering, Mechanical Engineering, Process Engineering, Chemistry, Research, & many other disciplines", "positions_text": "", "about_text": "At Illumina, we are committed to increasing the understanding of genomics to improve human health. We deliver innovative sequencing and array-based solutions that enable progress in disease research, drug discovery, and the development of molecular tests in clinical labs.  \n \nOur work has enabled significant progress in the field of genomics and we’re poised to be a substantial contributor for what many believe will be the next era of medicine -- that is the era of genomic medicine or personalized medicine. Perhaps that’s one reason why we were recently awarded the top spot on MIT Technology Review’s list of the 50 Smartest Companies in the World. \n \nIt’s the unstoppable drive to know more.  To find answers.  To be the first. ", "culture_text": "What we do may sound complicated, but why we're here is simple: Impact. Excitement. People.\n \nImpact\n Most of us joined Illumina because we wanted a spot on the team that's setting the pace—the one that's taking innovation to a whole new level.\n \nExcitement\n The work we do here is exciting, challenging. Everywhere you turn, there is an opportunity to learn…to give...to change...to grow. You can apply yourself in ways you never imagined. The energy is dynamic, the growth is fast, and the adrenaline is off the scale. You might work with some of the most brilliant scientists, engineers, and technology specialists in the country, or even the world. But that doesn't mean you'll work on the sidelines. On this team, everyone's work and ideas are valued and respected. Joining the Illumina community raises your potential for personal and professional growth exponentially.\n \nPeople\n We're serious about our work. But we're serious about having fun, too. We genuinely enjoy each other's company. And we respect each other's work. No matter what your function, background, or job level, you're on the team at Illumina. We're all in it together. And together, we achieve so much more.\n \nRealize your power with Illumina. You'll be amazed at what you can do."}, {"company_name": "Qualcomm", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "San Diego, CA, USA", "size_text": "33,000+ Employees", "industry_text": "", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "Life-changing technology starts with Qualcomm. \nFor over 30 years, our inventions have inspired others to make the impossible, possible. Now, we’re inventing ways for 5G and Artificial Intelligence to change how business gets done, redefine industries and improve lives everywhere.\n\nWe invent the tech the world loves.\nBefore there were smartphones or smart cities, before autonomous cars or 360° virtual reality videos, there was our technology. Qualcomm inventions are the foundational technologies that others build upon—inventing new industries and applications that have global impact. From 5G to artificial intelligence, from IoT to automotive and extended reality applications, Qualcomm is inventing the technologies the world loves.", "culture_text": "What’s it really like to work in the future @ Qualcomm?\nAt Qualcomm, students and college graduates jump right into next-generation technologies that are changing the wireless world. In a world where power and capabilities keep increasing to compete with other leading companies in the industry, Qualcomm knocks out its competition in almost every category.  \nOur guiding values sum it up. A breeding ground for innovation and creativity, the dynamic and engaging atmosphere allows for a productive and rewarding work ethic expressed by all employees around the world. This drive creates a widespread concept of understanding and an openness to bring together the brightest minds for collaboration. Every day you’ll see the direct link between the open, fun and relaxed way we work and the great real-world products we bring to market. Through enjoyment of the abundant fitness and recreation opportunities not exclusive to interns, employee interest groups and extras like QSOL, a company sponsored concert series staged on campus, and incredible opportunities to network within your group and the company as a whole, our focus on our connected and global network attract the people who strive to improve this company and industry as a whole. \nIf you’re an intern, Working at Qualcomm may be the closest you’ll get to experiencing time travel. For the last two decades, we’ve been creating mobile technologies to help connect people around the world and bring the future here faster. You won’t just work in a lab, or write lines of code. You’ll be an integral part of what’s next for mobility and the world.\n\nIf you’re a college graduate, You and mobile technology have something in common. You’re both going places that can change the world for the better and help bring the future here faster. And we think Qualcomm is the perfect place for you two to meet.\n\nIf you're an engineer, As an engineer at Qualcomm you have the opportunity to push the boundaries of what exists and establish the new standards for tomorrow. This is your chance to do something huge in mobile technology.\n\nIf you're a professional, Mobile technology is our passion. Marketing, human resources, and finance is yours. We are looking for experienced and talented go-getters to join us in the “never a dull day” technology space. Jump on."}, {"company_name": "Lyft", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "San Francisco, CA", "size_text": "3000+ Employees", "industry_text": "Transportation; Collaborative Consumption; Peer-to-Peer", "visa_sponsorship_text": "yes - (cpt, opt, j1)", "hiring_text": "FT and Interns", "positions_text": "Software Engineering, Data Science, Research Science, Product Management, Design, User Research, Autonomous Software & Hardware", "about_text": "Lyft was launched in June of 2012 in San Francisco, and has quickly become one of the fastest growing products in Silicon Valley. Lyft is the latest evolution of p2p transportation, and is built as a mobile-first service. Ride by ride, we’re changing the way our world works. We imagine a world where cities feel small again. Where transportation and tech bring people together, instead of apart. We see the future as community-driven — and it starts with you.", "culture_text": "At Lyft, we love writing code and solving problems all day. We’re excited about crafting technology that delights users and we care about the end result. We work closely in small teams with other passionate developers who are willing and able to express their opinions clearly and passionately. Our engineers have broad experience with technology, including different server languages, frameworks and databases, and are always excited to learn new technologies. We enjoy finding efficient and elegant solutions to complex problems. \nInterns and new grads will work side-by-side with top engineers in the industry. They'll work on user-facing products and will see their work go live quickly. \nThe Problems You'll Be Solving:\n\nRace conditions in a real-time server environment\nComplex, predictive matching algorithms with machine learning\nCustom recruitment, onboarding and scheduling tools\nIntegration with 3rd party services for identity, payment, notifications and monitoring\nOptimizing data layout in a schema-less database environment\n\nWhat Your Day Will Look Like:  \n\nBrief daily meeting to sync with small cross-functional team (scrum)\nGo off and crank on your project, checking in with other team members throughout the day with questions and updates\nYou leave the code in a better state than when you found it (progressive refactor)\nYou value reliability, ensured by automated testing (unit, integration and load tests)\nParticipate in code reviews to ensure code quality and distribute knowledge\nContinuous integration and deployment\nGo home knowing that your work today is meaningfully improving the lives of every Lyft driver and every Lyft passenger\n\nCheck out our video to learn about what it's like to work at Lyft!"}, {"company_name": "TripAdvisor", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Needham,  MA", "size_text": "3000+ Employees", "industry_text": "Technology", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "TripAdvisor® is the world's largest travel site*,enablingtravelers to unleash the potential of every trip. TripAdvisor offersadvice frommillions of travelers, with 500 million reviews and opinionscovering 7 millionaccommodations, restaurants and attractions, and a widevariety of travelchoices and planning features — checking more than 200websites to helptravelers find and book today's lowest hotel prices.TripAdvisor branded sitesmake up the largest travel community in the world,reaching 390 million averageunique monthly visitors** in 49 markets worldwide.TripAdvisor: Know better.Book better. Go better. TripAdvisor, Inc. (NASDAQ:TRIP), through itssubsidiaries, manages and operates websites under 23 othertravel media brands:www.airfarewatchdog.com,www.bookingbuddy.com, www.citymaps.com,www.cruisecritic.com, www.familyvacationcritic.com, www.flipkey.com,www.thefork.com (including www.lafourchette.com, www.eltenedor.com, www.iens.nland www.dimmi.com.au),www.gateguru.com, www.holidaylettings.co.uk, www.holidaywatchdog.com,www.housetrip.com, www.independenttraveler.com, www.jetsetter.com,www.niumba.com, www.onetime.com, www.oyster.com, www.seatguru.com,www.smartertravel.com, www.tingo.com, www.travelpod.com, www.tripbod.com,www.vacationhomerentals.com and www.viator.com. *Source: comScore MediaMetrixfor TripAdvisor Sites, worldwide, November 2016 **Source: TripAdvisorlogfiles, Q3 2016", "culture_text": "Work hard. Play hard. Speed wins.\n\nWe’re reinventing the way travelers plan trips. There’s a lot to do, and we’re pushing ourselves to get it done in new and exciting ways.\n\nAt TripAdvisor, you will put your experience to work and watch it pay off. You'll make a difference quickly and have a direct impact on our continuing success. Plus, you’ll manage your own career path and ongoing learning.\n\nTripAdvisor gives you access to learning and development resources including training programs, e-learning courses, and support from our learning and development team.\n\nAnd you’ll do it while working in an energetic, positive atmosphere with really smart, nice people. Innovative, forward thinking is highly valued. After all, speed wins."}, {"company_name": "Chan Zuckerberg Initiative", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Palo Alto, CA", "size_text": "200-500 Employees", "industry_text": "", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "Founded by Dr. Priscilla Chan and Mark Zuckerberg in 2015, the Chan Zuckerberg Initiative (CZI) is a new kind of philanthropy that’s leveraging technology to help solve some of the world’s toughest challenges – from eradicating disease, to improving education, to reforming the criminal justice system. Across three core Initiative focus areas of Science, Education and Justice and Opportunity,  we’re pairing engineering with grantmaking, impact investing, policy work, and movement building, to help build an inclusive, just and healthy future for everyone. To learn more, visit our Facebook page.", "culture_text": ""}, {"company_name": "IBM", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Armonk, NY", "size_text": "400,000 Employees", "industry_text": "", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "There is no other company like IBM and there is no business professional like the IBMer. We are experts in nearly every technical scientific and business field. We are citizens of, and apply our expertise in, more than 170 countries. Yet we are united by a single purpose: to be essential. We do that by creating the most advanced technology to change how our clients work and run their businesses.And through them, IBMers change how the world works. The world is at a major turning point: technology is enabling entirely new forms of business operations, business models, industries and outcomes. We have exponentially more power to reach the full potential of our life’s work than any humans before us.Explore the different entry-level, intern, co-op and graduate career paths available to you at IBM and apply today", "culture_text": "We are a global technology and innovation company that lives at the intersection of business and technology. We are the only company in our industry that has reinvented itself for more than a century. IBM defines itself not by what our products or solutions but by who we are —IBMers; more than any other invention of the company, it's the IBMer who drives progress and transformation. Our unparalleled history of equal opportunity employment is based off our firm’s long standing commitment to diversity, acceptance, and inclusion. We work in agile ways and encourage our people to think, challenge the status quo, and anticipate future direction to help our clients succeed."}, {"company_name": "Riot Games", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Los Angeles, CA", "size_text": "1001-5000 Employees", "industry_text": "Computer Games", "visa_sponsorship_text": "", "hiring_text": "Summer 2018 Interns", "positions_text": "//www.riotgames.com/universityprograms", "about_text": "We aspire to be the most player-focused game company in the world. We were established in 2006 by a couple of entrepreneurial gamers who believe player-focused game development can result in awesome games. In 2009, we released our debut title, League of Legends, to critical and player acclaim. Over 100 million play every month.\n\nWe know players form the foundation of our community and it’s for them that we continue to evolve and improve the League of Legends experience.", "culture_text": "Our goal is to become the most player-focused company in the world. With this mission in mind, we develop high-quality games and services enjoyed by tens of millions of players around the world.\n\n\nTo help ensure that every hire is truly onboard and aligned with our mission to serve players, we rigorously screen every candidate not just for skill and experience but also for cultural fit. To this end, we also offer new hires cash to quit -- because we want everyone here to be really bought in to our mission and values.\n\n\nWe also take play seriously. For us, it’s never \"just a game.\" We play lots of games, especially our own. Everyone’s first day at Riot begins with a play test. We try to make it a daily habit. Although we’re serious professionals, we don’t take ourselves too seriously. Whether it’s memes in presentations, squirt guns at Show & Tell, or the PC Bangs built into the heart of new offices, we make time for play and fun.\n\n\nAt our core, we're a group of passionate people who embrace new challenges, thrive in finding smart, out-of-the-box solutions, sometimes lose things, and love League of Legends and this industry."}, {"company_name": "Groupon", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Chicago, IL", "size_text": "6,000+ Employees", "industry_text": "Technology, E-commerce, Discounts, Marketing, Travel", "visa_sponsorship_text": "", "hiring_text": "Full Time and Summer Internship Opportunities", "positions_text": "Software Development Engineers (Web & Mobile), Product Managers, Data Scientists, Design (Visual & Product), Sales", "about_text": "Groupon (NASDAQ: GRPN) is building the daily habit in local commerce, offering a vast mobile and online marketplace where people discover and save on amazing things to do, see, eat and buy. By enabling real-time commerce across local businesses, travel destinations, consumer products and live events, shoppers can find the best a city has to offer. Groupon is redefining how small businesses attract and retain customers by providing them with customizable and scalable marketing tools and services to profitably grow their businesses. To download Groupon's top-rated mobile apps, visit www.groupon.com/mobile. To search for great deals or subscribe to Groupon emails, visit www.groupon.com. To learn more about the company's merchant solutions and how to work with Groupon, visit www.groupon.com/merchant.", "culture_text": "We're a \"best of both worlds\" kind of company. We're big enough to have resources and scale, but small enough that a single person has a surprising amount of autonomy and can make a meaningful impact. We're curious, fun, a little intense, and kind of obsessed with helping local businesses thrive. Does that sound like a compelling place to work?\n\nClick the video to see why we love working at Groupon!"}, {"company_name": "Airbnb", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "San Francisco, CA", "size_text": "2900 Employees", "industry_text": "Online Travel; Peer-to-Peer; Hotels; Local", "visa_sponsorship_text": "yes", "hiring_text": "", "positions_text": "Software Engineering", "about_text": "Founded in August of 2008 and based in San Francisco, California, Airbnb is a trusted community marketplace for people to list, discover, and book unique accommodations around the world — online or from a mobile phone.\n \n\nWith 10 million nights booked and counting, we're constantly tackling challenges in search algorithms, payments, fraud prevention, and growth — all while maintaining a beautiful user experience. We want to build solutions to these problems that are scalable, performant, and elegant, and we're looking for talented people to help us do just that.", "culture_text": "At Airbnb, we believe in the mission our product promotes: to create a world that inspires human connection, to create something that is fundamentally good for the world. Transparency here is the norm. Our most prized asset is our team, and we believe in empowering them with all of the facts. We know the future of our product is found through innovation, and we’re always searching for fellow engineers and entrepreneurs that share our vision, those leaders who see themselves not as knowers, but learners.\n \nHalf of our interns in 2014 were women engineers, and we’re proud to create an environment that supports women leaders in technology. This year we hosted the “Taking Flight: An Evening for Women in Engineering” event to inspire women in engineering as we brought together established engineers in the industry with interns looking to learn, connect and belong. You can learn more about the event here, or by searching #AirbnbTakingFlight on Twitter."}, {"company_name": "Avanade", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Seattle Washington", "size_text": "30,000 Employees", "industry_text": "IT Consulting", "visa_sponsorship_text": "no", "hiring_text": "", "positions_text": "", "about_text": "Think you can change the world? So do we. \n\nAt Avanade, we believe in making a genuine human impact in everything we do. Here, you will help transform businesses, uncover ways technology can improve the way we work and live, and change the world for the better. All this through the power of our people and cutting-edge Microsoft technology. In return, you will have access to incredible clients, unparalleled training and an exciting career path whether you’re just starting out or have decades of experience under your belt.\n\nThere's no place like it. \n\nIf you’re a self-starter, an optimist and someone who likes to get things done, you’ll fit right in at Avanade. People who thrive here are motivated, interested in learning and genuinely have a desire to be the best at what they do. If that’s sounds like you, you sound good to us. \n\nFurther, faster\nAs you launch your career, we understand what it means to keep moving forward. That's why we give you a minimum of 80 training hours per year across the newest technologies, client solutions and soft skills.\n\nMore than tech\nDay-to-day, you'll work on digital projects surrounded by people who have a passion for delivering results for our clients and their customers.\n\nReal world, real career\nWe're looking for current students or recent graduates with a passion for technology.\n\nIf you're ready to ignite your career, join us.\nwww.avanade.com/careers", "culture_text": ""}, {"company_name": "Avanade", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Seattle Washington", "size_text": "30,000 Employees", "industry_text": "IT Consulting", "visa_sponsorship_text": "no", "hiring_text": "", "positions_text": "", "about_text": "Think you can change the world? So do we. \n\nAt Avanade, we believe in making a genuine human impact in everything we do. Here, you will help transform businesses, uncover ways technology can improve the way we work and live, and change the world for the better. All this through the power of our people and cutting-edge Microsoft technology. In return, you will have access to incredible clients, unparalleled training and an exciting career path whether you’re just starting out or have decades of experience under your belt.\n\nThere's no place like it. \n\nIf you’re a self-starter, an optimist and someone who likes to get things done, you’ll fit right in at Avanade. People who thrive here are motivated, interested in learning and genuinely have a desire to be the best at what they do. If that’s sounds like you, you sound good to us. \n\nFurther, faster\nAs you launch your career, we understand what it means to keep moving forward. That's why we give you a minimum of 80 training hours per year across the newest technologies, client solutions and soft skills.\n\nMore than tech\nDay-to-day, you'll work on digital projects surrounded by people who have a passion for delivering results for our clients and their customers.\n\nReal world, real career\nWe're looking for current students or recent graduates with a passion for technology.\n\nIf you're ready to ignite your career, join us.\nwww.avanade.com/careers", "culture_text": ""}, {"company_name": "Avanade", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Seattle Washington", "size_text": "30,000 Employees", "industry_text": "IT Consulting", "visa_sponsorship_text": "no", "hiring_text": "", "positions_text": "", "about_text": "Think you can change the world? So do we. \n\nAt Avanade, we believe in making a genuine human impact in everything we do. Here, you will help transform businesses, uncover ways technology can improve the way we work and live, and change the world for the better. All this through the power of our people and cutting-edge Microsoft technology. In return, you will have access to incredible clients, unparalleled training and an exciting career path whether you’re just starting out or have decades of experience under your belt.\n\nThere's no place like it. \n\nIf you’re a self-starter, an optimist and someone who likes to get things done, you’ll fit right in at Avanade. People who thrive here are motivated, interested in learning and genuinely have a desire to be the best at what they do. If that’s sounds like you, you sound good to us. \n\nFurther, faster\nAs you launch your career, we understand what it means to keep moving forward. That's why we give you a minimum of 80 training hours per year across the newest technologies, client solutions and soft skills.\n\nMore than tech\nDay-to-day, you'll work on digital projects surrounded by people who have a passion for delivering results for our clients and their customers.\n\nReal world, real career\nWe're looking for current students or recent graduates with a passion for technology.\n\nIf you're ready to ignite your career, join us.\nwww.avanade.com/careers", "culture_text": ""}, {"company_name": "Avanade", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Seattle Washington", "size_text": "30,000 Employees", "industry_text": "IT Consulting", "visa_sponsorship_text": "no", "hiring_text": "", "positions_text": "", "about_text": "Think you can change the world? So do we. \n\nAt Avanade, we believe in making a genuine human impact in everything we do. Here, you will help transform businesses, uncover ways technology can improve the way we work and live, and change the world for the better. All this through the power of our people and cutting-edge Microsoft technology. In return, you will have access to incredible clients, unparalleled training and an exciting career path whether you’re just starting out or have decades of experience under your belt.\n\nThere's no place like it. \n\nIf you’re a self-starter, an optimist and someone who likes to get things done, you’ll fit right in at Avanade. People who thrive here are motivated, interested in learning and genuinely have a desire to be the best at what they do. If that’s sounds like you, you sound good to us. \n\nFurther, faster\nAs you launch your career, we understand what it means to keep moving forward. That's why we give you a minimum of 80 training hours per year across the newest technologies, client solutions and soft skills.\n\nMore than tech\nDay-to-day, you'll work on digital projects surrounded by people who have a passion for delivering results for our clients and their customers.\n\nReal world, real career\nWe're looking for current students or recent graduates with a passion for technology.\n\nIf you're ready to ignite your career, join us.\nwww.avanade.com/careers", "culture_text": ""}, {"company_name": "RBC - Royal Bank of Canada", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Toronto, Ontario Canada", "size_text": "81,000+ Employees", "industry_text": "", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "With more than 150 years in the financial industry, we’ve learned what it takes to succeed. We’re helping our clients thrive, providing opportunities for employees to grow in a variety of types of careers, and helping communities prosper\n\nWe are one of North America’s leading diversified financial services companies, and provide personal and commercial banking, wealth management, insurance, investor services and capital markets products and services on a global basis. We have approximately 81,000 full- and part-time employees who serve more than 16 million personal, business, public sector and institutional clients through offices in Canada, the U.S. and 35 other countries.", "culture_text": "Let's lead banking into the future. Your curiosity and ambition fuel our tomorrow. We’ll give you the tools, the partners and the opportunities to create new possibilities for our clients and your career.\n\nRBCers share the common purpose of turning possibilities into reality for our clients, our communities and each other. We’re bringing talented people together and giving them the opportunities to dream big, create and find a new kind of success.\n\nHelp Clients Thrive\nDiscover the diverse business segments at RBC – each with a focus on different solutions to help our clients thrive.\n\nHelp Communities Prosper\nRBC is committed to leading smart and sustainable strategies that help our communities prosper.\n\nDream Big And Achieve\nWe’re investing in you – creating new and exciting possibilities for our clients, our communities, and your career. We believe in our employees. Bring your goals and ambitions and we will provide the tools, experience and partners you’ll need to achieve your best"}, {"company_name": "OneTrust", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Atlanta, GA", "size_text": "100 - 200 Employees", "industry_text": "Software", "visa_sponsorship_text": "H1-b sponsorship available", "hiring_text": "", "positions_text": "Technical Implementation Consultant;\nJava Developer", "about_text": "OneTrust is the leading and fastest growing privacy management software platform used by hundreds of organizations globally to comply with data privacy regulations across sectors and jurisdictions, including the EU GDPR and Privacy Shield.\n\nOur comprehensive, integrated, technology-based solutions include readiness and privacy impact assessments, data inventory and mapping automation, website scanning and consent management, subject rights requests, incident reporting, and vendor risk management.\n\nThe OneTrust platform is pre-configured with templates and workflows that can be easily tailored via our point-and-click UI based on unique industry and organizational requirements. We make it easy for privacy teams to get started with OneTrust by giving them the flexibility to upgrade platform capabilities as their program matures, deploy in the cloud or on premise, and scale to support a growing network of privacy champions.\n\nOneTrust is based in Atlanta, GA and London, UK with a team of local privacy and technology experts across North America, Asia, and Europe.\n\nOneTrust is backed by the founders of Manhattan Associates (NASDAQ: MANH) and AirWatch ($1.54B acq by VMWare).", "culture_text": "You can expect tremendous professional development hyper-growth opportunities; an opportunity to work in an open environment on solutions that are reshaping the way businesses operate; and respect for your ideas. We believe in recognition for a job well-done, competitive salaries and a fast paced, entrepreneurial environment. "}, {"company_name": "Baidu China", "logo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ixpaahbppywdk/1505599530_375.png", "headquarters_text": "Beijing China", "size_text": "40,000 Employees", "industry_text": "", "visa_sponsorship_text": "", "hiring_text": "", "positions_text": "", "about_text": "Baidu, Inc. (Chinese: 百度; pinyin: Bǎidù, anglicized /ˈbaɪduː/ BY-doo), incorporated on 18 January 2000, is a Chinese multinational technology company specializing in Internet-related services and products, and artificial intelligence, headquartered at the Baidu Campus in Beijing's Haidian District. It is one of the largest AI and internet companies in the world. Baidu was established in 2000 by Robin Li. \n\n从2016年开始，百度将人工智能业务提升为公司发展的战略目标。百度AI生态不断完善，AI产品化、商业化持续加速。作为AI生态的重要组成，百度已拥有Apollo自动驾驶开放平台和DuerOS对话式人工智能操作系统两大开放生态，在智能驾驶和智能家居两大重要场景持续发力。\n百度智能云以“AI、大数据、云计算“三位一体差异化发展为战略，为垂直领域合作伙伴提供最先进的人工智能技术支持。\n\n在AI赋能下，百度已孵化出“度小满”和“爱奇艺”两大独立业务。“度小满”是百度旗下新拆分出来的金融服务事业群组，在金融领域将开放更多平台和技术能力，加大金融生态建设。作为百度新移动业务的重要组成，3月底爱奇艺正式在美国纳斯达克挂牌上市。截至2018年3月31日，爱奇艺会员规模达6130万，单季度新增会员数已达1050万，同比增长72%。爱奇艺与百度在内容、云服务、数据、人工智能技术等领域发挥协同作用。", "culture_text": "“Simple and reliable” isn’t just about Baidu’s core values, but also defines the way we should interact with others, and forms the guiding principle for all our work.\n\n“Simple” literally means pure and uncomplicated. For Baidu, it is not only a value, but also an approach to doing things, requiring us to deal with people and things in an uncomplicated way, and to provide the simplest products.\n\nA“reliable” person or thing is one that can be trusted and counted on. “Reliable” does not equal “trustworthy.” In the sense that we use it, “reliable” has something akin to familial love in it. “Reliability” as advocated by Baidu requires everyone to be professionally strong, to fully trust colleagues, and to devote familial love to and help one another."}]